{
    "role": "COACH",
    "description": "Quy định dành cho huấn luyện viên cung cấp dịch vụ đào tạo thể thao",
    "policies": [
        {
            "id": "COMMON_01",
            "topic": "Giới thiệu chung",
            "rules": [
                "Chào mừng bạn gia nhập cộng đồng SportZone. Chúng tôi cam kết tạo ra một môi trường thể thao lành mạnh, minh bạch và chuyên nghiệp."
            ]
        },
        {
            "id": "COMMON_02",
            "topic": "Trách nhiệm của đối tác",
            "rules": [
                "Cung cấp thông tin chính xác, trung thực về hồ sơ, sân bãi và dịch vụ.",
                "Duy trì thái độ chuyên nghiệp, tôn trọng khách hàng và cộng đồng.",
                "Đảm bảo chất lượng dịch vụ đúng như cam kết.",
                "Tuân thủ các quy định về an toàn và pháp luật hiện hành."
            ]
        },
        {
            "id": "COMMON_03",
            "topic": "Chính sách thanh toán & Phí dịch vụ",
            "rules": [
                "SportZone áp dụng mức phí dịch vụ cho mỗi giao dịch thành công. Chi tiết về biểu phí và chu kỳ thanh toán được quy định rõ trong phần Quản lý tài chính."
            ]
        },
        {
            "id": "COMMON_04",
            "topic": "Quyền riêng tư & Bảo mật dữ liệu",
            "rules": [
                "Chúng tôi coi trọng quyền riêng tư của bạn. Mọi thông tin cá nhân và dữ liệu kinh doanh sẽ được bảo vệ theo tiêu chuẩn bảo mật cao nhất."
            ]
        },
        {
            "id": "COMMON_05",
            "topic": "Chấm dứt hợp tác",
            "rules": [
                "SportZone có quyền tạm ngưng hoặc chấm dứt tài khoản đối tác nếu phát hiện vi phạm nghiêm trọng các điều khoản này hoặc có hành vi gian lận."
            ]
        },
        {
            "id": "CH_01",
            "topic": "Quản lý Slot và Đặt lịch",
            "rules": [
                "Coach phải cập nhật trạng thái lịch dạy thời gian thực. Mọi sự cố trùng lịch do lỗi cập nhật chậm sẽ do coach chịu trách nhiệm.",
                "Được phép tạo 'Slot tự khóa' để phục vụ học viên riêng hoặc nghỉ phép.",
                "Cơ chế phí Slot tự khóa: Giá booking = 0, nhưng phải trả phí hệ thống (System Fee) dựa trên giá niêm yết của khung giờ đó theo chính sách SportZone."
            ]
        },
        {
            "id": "CH_02",
            "topic": "Hồ sơ chuyên môn và Dịch vụ",
            "rules": [
                "Coach phải cung cấp bằng cấp, chứng chỉ hoặc kinh nghiệm thực tế để hệ thống xác minh.",
                "Thông tin hiển thị trên profile phải trung thực, không mạo danh tổ chức hoặc huấn luyện viên khác.",
                "Mọi thay đổi về giá dịch vụ phải thông báo trước ít nhất 24h và không áp dụng hồi tố cho các booking đã xác nhận."
            ]
        },
        {
            "id": "CH_03",
            "topic": "Hủy lịch và Phạt vi phạm",
            "rules": [
                "Nếu coach hủy lịch của học viên vì lý do chủ quan: Phải hoàn 100% tiền và chịu phí phạt vi phạm theo quy định vào ví hệ thống.",
                "Nếu hủy do thiên tai/bất khả kháng: Hoàn tiền 100%, không tính phí phạt.",
                "Coach phải đảm bảo an toàn cho học viên trong suốt buổi tập. SportZone không chịu trách nhiệm về chấn thương phát sinh do lỗi phương pháp giảng dạy."
            ]
        },
        {
            "id": "CH_04",
            "topic": "Thanh toán và Đối soát",
            "rules": [
                "Doanh thu từ booking học viên sẽ được giữ bởi SportZone và đối soát định kỳ theo chu kỳ thanh toán.",
                "Coach có quyền rút tiền khi số dư ví đạt ngưỡng tối thiểu theo quy định của nền tảng.",
                "SportZone thu phí hoa hồng 5% trên mỗi booking thành công, bao gồm quản lý lịch và vận hành thanh toán."
            ]
        }
    ]
}